---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DividedPathFailures.DividedPathCannotApplyDivideSettings
source: html/7803ed22-76e6-dee0-39f3-14c3b4eaa970.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedPathFailures.DividedPathCannotApplyDivideSettings Property

Default Divide settings cannot be applied to Divided Path.

## Syntax (C#)
```csharp
public static FailureDefinitionId DividedPathCannotApplyDivideSettings { get; }
```